---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.NoConstraintsToLinks1
source: html/403697fb-4de4-fc72-df1c-8077f7281a38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.NoConstraintsToLinks1 Property

Constraints may not be created to linked instances using Shared Locations. Constraints will be removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoConstraintsToLinks1 { get; }
```